//შევქმნათ ჯავასკრიპტის ფუნქცია რომეკსაც გადაეცემა მასივი და აბრუნებს მასივს ორი ელემენტით, პირველი ელემენტი არის უდიდესი რიცხვი გადაცემული მასივიდან, ხოლო მეორე უმცირესი.


function findMaxMin(arr) {
    let max = arr[0];  //  მაქსიმუმი
    let min = arr[0];  // მინიმუმი
    
    for (let i = 1; i < arr.length; i++) {  // იწყება მეორედან რადგან პირველი უკვე მაქსიმუმია
      if (arr[i] > max) {  // თუ მიმდინარე ელემენტი უფრო დიდია ანახლებს მაქსიმუმს
        max = arr[i];  // 
      }
      if (arr[i] < min) {  // თუ ეს ელემენტი უფრო პატარაა ანახლებს მინიმუმს
        min = arr[i]; 
      }
    }
    
    return [max, min];  // აბრუნებს მასივში მაქსმუმს და მინიმუმს
  }